
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第七章 一般结论和观点 · Blankj's Glory</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Blankj">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../第六章/第六章.html" />
    

    
        <link rel="shortcut icon" href='../source/images/favicon.jpg' type="image/x-icon">
    
    
        <link rel="bookmark" href='../source/images/favicon.jpg' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='../source/images/apple-touch-icon.jpg'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="../source/images/apple-touch-icon.jpg">
        
        <link rel="apple-touch-icon" sizes="180x180" href="../source/images/apple-touch-icon.jpg">
        
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"Blankj","repo":"glory","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://blankj.com" target="_blank" class="custom-link">我的狗窝</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">摘要</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../摘要/Abstract.html">
            
                <a href="../摘要/Abstract.html">
            
                    
                    摘要
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第一章</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../第一章/第一章.html">
            
                <a href="../第一章/第一章.html">
            
                    
                     简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二章</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../第二章/第二章.html">
            
                <a href="../第二章/第二章.html">
            
                    
                    第二章  深度神经网络解释的背景知识
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三章</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../第三章/chapter3.html">
            
                <a href="../第三章/chapter3.html">
            
                    
                    第三章 基于特征解释的难点和主观性
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四章</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../第四章/第四章.html">
            
                <a href="../第四章/第四章.html">
            
                    
                    第四章 验证基于特征的事后解释方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五章</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../第五章/第五章.html">
            
                <a href="../第五章/第五章.html">
            
                    
                    第五章 生成自然语言解释的神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第六章</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="../第六章/第六章.html">
            
                <a href="../第六章/第六章.html">
            
                    
                    第六章 验证产生自然语言解释的神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第七章</li>
        
        
    
        <li class="chapter active" data-level="8.1" data-path="第七章.html">
            
                <a href="第七章.html">
            
                    
                    第七章 一般结论和观点
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第七章 一般结论和观点</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#&#x7B2C;&#x4E03;&#x7AE0;-&#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;"><b></b>&#x7B2C;&#x4E03;&#x7AE0; &#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;</a></li></ul></div><a href="#&#x7B2C;&#x4E03;&#x7AE0;-&#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="&#x7B2C;&#x4E03;&#x7AE0;-&#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;"><a name="&#x7B2C;&#x4E03;&#x7AE0;-&#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;" class="anchor-navigation-ex-anchor" href="#&#x7B2C;&#x4E03;&#x7AE0;-&#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;"><i class="fa fa-link" aria-hidden="true"></i></a><a name="&#x7B2C;&#x4E03;&#x7AE0;-&#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;" class="plugin-anchor" href="#&#x7B2C;&#x4E03;&#x7AE0;-&#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7B2C;&#x4E03;&#x7AE0; &#x4E00;&#x822C;&#x7ED3;&#x8BBA;&#x548C;&#x89C2;&#x70B9;</h1>
<p>&#x5728;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;&#x6211;&#x7814;&#x7A76;&#x4E86;&#x89E3;&#x91CA;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x65B9;&#x5411;:&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x4E8B;&#x540E;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x548C;&#x4E3A;&#x9884;&#x6D4B;&#x751F;&#x6210;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x795E;&#x7ECF;&#x6A21;&#x578B;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x6211;&#x90FD;&#x8C03;&#x67E5;&#x4E86;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E9B;&#x89E3;&#x91CA;&#x662F;&#x5426;&#x5FE0;&#x5B9E;&#x4E8E;&#x5B83;&#x4EEC;&#x6240;&#x8981;&#x89E3;&#x91CA;&#x7684;&#x6A21;&#x578B;&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x751F;&#x6210;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x6211;&#x8C03;&#x67E5;&#x4E86;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x662F;&#x5426;&#x7531;&#x4E8E;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#x4EE5;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x7684;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x4E86;&#x989D;&#x5916;&#x7684;&#x76D1;&#x7763;&#x800C;&#x8868;&#x73B0;&#x51FA;&#x6539;&#x8FDB;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#x3002;</p>
<p>&#x200B;        &#x9996;&#x5148;&#xFF0C;&#x6211;&#x5C55;&#x793A;&#x4E86;&#xFF0C;&#x5C3D;&#x7BA1;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x9690;&#x542B;&#x5047;&#x8BBE;&#xFF0C;&#x5373;&#x5BF9;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x6A21;&#x578B;&#x9884;&#x6D4B;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x771F;&#x5B9E;&#x503C;&#x89E3;&#x91CA;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x8FD8;&#x5C55;&#x793A;&#x4E86;&#x4E24;&#x7C7B;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x540E;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x57FA;&#x4E8E;&#x4E8B;&#x5B9E;&#x7684;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x8BF4;&#x660E;&#xFF0C;&#x6211;&#x8FD8;&#x63ED;&#x793A;&#x4E86;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x67D0;&#x4E9B;&#x4F18;&#x52BF;&#x548C;&#x5C40;&#x9650;&#x6027;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x89E3;&#x91CA;&#x90FD;&#x4E0D;&#x8DB3;&#x4EE5;&#x4E3A;&#x6A21;&#x578B;&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x6211;&#x8FD8;&#x8BF4;&#x660E;&#x4E86;&#x88AB;&#x671F;&#x671B;&#x4E3A;&#x6BCF;&#x4E2A;&#x9884;&#x6D4B;&#x63D0;&#x4F9B;&#x76F8;&#x5173;&#x7279;&#x6027;&#x7684;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x7C7B;&#x578B;&#x7684;&#x795E;&#x7ECF;&#x6A21;&#x578B;&#x5728;&#x8FD9;&#x6837;&#x505A;&#x65F6;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x4EE5;&#x51CF;&#x8F7B;&#x8FD9;&#x4E9B;&#x5C40;&#x9650;&#x6027;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x200B;        &#x4E3A;&#x4E86;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECA;&#x540E;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4E25;&#x683C;&#x7684;&#x89C4;&#x8303;&#x3002;&#x5BF9;&#x89E3;&#x91CA;&#x5982;&#x4F55;&#x63D0;&#x4F9B;&#x6A21;&#x578B;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x7684;&#x5B8C;&#x6574;&#x89C6;&#x56FE;&#x8FDB;&#x884C;&#x66F4;&#x591A;&#x7684;&#x7814;&#x7A76;&#x4E5F;&#x5C06;&#x662F;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5C06;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x7528;&#x4E8E;&#x5BF9;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x63D0;&#x4F9B;&#x53EF;&#x9760;&#x7684;&#x89C1;&#x89E3;&#x4E5F;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7814;&#x7A76;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x200B;        &#x5176;&#x6B21;&#xFF0C;&#x6211;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#x6765;&#x9A8C;&#x8BC1;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x4E8B;&#x540E;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x6240;&#x63D0;&#x4F9B;&#x89E3;&#x91CA;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x3002;&#x8BE5;&#x6846;&#x67B6;&#x4F9D;&#x8D56;&#x4E8E;&#x4F7F;&#x7528;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x6A21;&#x578B;&#xFF0C;&#x5728;&#x8FD9;&#x7C7B;&#x6A21;&#x578B;&#x7684;&#x5C40;&#x9650;&#x6027;&#x5F97;&#x5230;&#x7F13;&#x89E3;&#x4E4B;&#x540E;&#x3002;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x662F;&#x81EA;&#x52A8;&#x7684;&#xFF0C;&#x5E76;&#x5728;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x7684;&#x573A;&#x666F;&#x4E2D;&#x9A8C;&#x8BC1;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x771F;&#x5B9E;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x7684;&#x975E;&#x5E73;&#x51E1;&#x7684;&#x795E;&#x7ECF;&#x6A21;&#x578B;&#x4E0A;&#x3002;&#x8BE5;&#x6846;&#x67B6;&#x4E5F;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x9009;&#x62E9;&#x5668;&#x548C;&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x5757;&#x7684;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x548C;&#x5176;&#x4ED6;&#x67B6;&#x6784;&#x4E0A;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x6F5C;&#x5728;&#x7684;&#x5927;&#x91CF;&#x73B0;&#x6210;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x6D4B;&#x8BD5;&#x3002;&#x5BF9;&#x4E09;&#x79CD;&#x5E38;&#x7528;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;&#x8BE5;&#x6846;&#x67B6;&#x5177;&#x6709;&#x63ED;&#x793A;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x4E0D;&#x8BDA;&#x5B9E;&#x89E3;&#x91CA;&#x7684;&#x6F5C;&#x529B;&#x3002;&#x6211;&#x8FD8;&#x63D0;&#x51FA;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x8FDB;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x200B;        &#x4F5C;&#x4E3A;&#x4ECA;&#x540E;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x8FDB;&#x5F15;&#x8FDB;&#x7684;&#x6838;&#x67E5;&#x6846;&#x67B6;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x6211;&#x5728;&#x7B2C;4.6&#x8282;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684;&#x51C6;&#x5219;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x57FA;&#x4E8E;&#x7279;&#x6027;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x9A8C;&#x8BC1;&#x89E3;&#x91CA;&#x8005;&#x7684;&#x6D4B;&#x8BD5;&#x5E73;&#x53F0;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BF7;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#xFF0C;&#x5F15;&#x5165;&#x7684;&#x6846;&#x67B6;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x6027;&#x68C0;&#x67E5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x8BC4;&#x4F30;&#x6846;&#x67B6;&#xFF0C;&#x7528;&#x4E8E;&#x63D0;&#x4F9B;&#x5B8C;&#x5168;&#x901A;&#x7528;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x6027;&#x80FD;&#x3002;&#x4E5F;&#x975E;&#x5E38;&#x9700;&#x8981;&#x5B8C;&#x6574;&#x7684;&#x8BC4;&#x4EF7;&#x6846;&#x67B6;&#x3002;</p>
<p>&#x200B;        &#x7B2C;&#x4E09;&#xFF0C;&#x6211;&#x7814;&#x7A76;&#x4E86;&#x4E00;&#x7C7B;&#x81EA;&#x6211;&#x89E3;&#x91CA;&#x7684;&#x795E;&#x7ECF;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x9884;&#x6D4B;&#x751F;&#x6210;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x6570;&#x636E;&#x96C6;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x6211;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5927;&#x578B;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6570;&#x636E;&#x96C6;&#x7EA6;&#x4E3A;570K&#x4EBA;&#x7C7B;&#x7F16;&#x5199;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#xFF0C;&#x6211;&#x79F0;&#x4E4B;&#x4E3A;e-SNLI&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x8FD8;&#x6307;&#x51FA;&#xFF0C;&#x795E;&#x7ECF;&#x6A21;&#x578B;&#x4F9D;&#x9760;&#x865A;&#x5047;&#x7684;&#x76F8;&#x5173;&#x6765;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x7684;&#x89E3;&#x91CA;&#x6BD4;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x7684;&#x6807;&#x7B7E;&#x8981;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#x3002;&#x8FD9;&#x4ECE;&#x7ECF;&#x9A8C;&#x4E0A;&#x652F;&#x6301;&#x4E86;&#x4E00;&#x79CD;&#x76F4;&#x89C9;&#xFF0C;&#x5373;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x6B63;&#x786E;&#x7684;&#x8BBA;&#x8BC1;&#x548C;&#x6B63;&#x786E;&#x7684;&#x9884;&#x6D4B;&#x7684;&#x6A21;&#x578B;&#x6BD4;&#x53EA;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x9884;&#x6D4B;&#x7684;&#x6A21;&#x578B;&#x66F4;&#x53EF;&#x9760;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x8FD8;&#x5C55;&#x793A;&#x4E86;&#x5728;&#x6D4B;&#x8BD5;&#x65F6;&#x751F;&#x6210;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x6A21;&#x578B;&#x5728;&#x751F;&#x6210;&#x6B63;&#x786E;&#x89E3;&#x91CA;&#x65B9;&#x9762;&#x7684;&#x6027;&#x80FD;&#x76F8;&#x5BF9;&#x8F83;&#x4F4E;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4E5F;&#x5C55;&#x793A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x5E26;&#x6765;&#x6539;&#x8FDB;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x5C55;&#x793A;&#x4E86;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#x51FA;&#x73B0;&#x7684;&#x9644;&#x52A0;&#x89E3;&#x91CA;&#xFF0C;&#x8FD9;&#x4E9B;&#x89E3;&#x91CA;&#x5F15;&#x5BFC;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x66F4;&#x597D;&#x7684;&#x901A;&#x7528;&#x53E5;&#x5B50;&#x8868;&#x793A;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x57DF;&#x5916;&#x5B9E;&#x4F8B;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x6539;&#x8FDB;&#x5BF9;&#x4E8E;&#x88AB;&#x6D4B;&#x8BD5;&#x7684;&#x6A21;&#x578B;&#x6765;&#x8BF4;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x3002;</p>
<p>&#x200B;        &#x672A;&#x6765;&#x7684;&#x5DE5;&#x4F5C;&#x5C06;&#x8FDB;&#x4E00;&#x6B65;&#x5F00;&#x53D1;e-SNLI&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4EE5;&#x63A8;&#x8FDB;&#x7814;&#x7A76;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x8BAD;&#x7EC3;&#x548C;&#x751F;&#x6210;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x3002;&#x672C;&#x6587;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x867D;&#x7136;&#x63D0;&#x4F9B;&#x4E86;&#x4EE4;&#x4EBA;&#x9F13;&#x821E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x8FD8;&#x4E0D;&#x80FD;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x90E8;&#x7F72;&#xFF0C;&#x9700;&#x8981;&#x505A;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x6765;&#x63A8;&#x8FDB;&#x8FD9;&#x4E2A;&#x6709;&#x5E0C;&#x671B;&#x7684;&#x65B9;&#x5411;&#x3002;&#x65B0;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x6570;&#x636E;&#x96C6;&#x4E5F;&#x5C06;&#x975E;&#x5E38;&#x6709;&#x76CA;&#x3002;</p>
<p>&#x200B;        &#x7B2C;&#x56DB;&#xFF0C;&#x4E3A;&#x4E86;&#x9A8C;&#x8BC1;&#x751F;&#x6210;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x7684;&#x771F;&#x5B9E;&#x6027;&#xFF0C;&#x6211;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x6297;&#x6027;&#x6846;&#x67B6;&#x6765;&#x68C0;&#x67E5;&#x795E;&#x7ECF;&#x6A21;&#x578B;&#x662F;&#x5426;&#x751F;&#x6210;&#x4E86;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x3002;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x89E3;&#x91CA;&#x8981;&#x4E48;&#x66B4;&#x9732;&#x4E86;&#x4E0D;&#x8BDA;&#x5B9E;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x8981;&#x4E48;&#x66B4;&#x9732;&#x4E86;&#x6A21;&#x578B;&#x7684;&#x9519;&#x8BEF;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#x3002;&#x6211;&#x5C06;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x5E94;&#x7528;&#x5230;&#x5728;e-SNLI&#x4E0A;&#x4EA7;&#x751F;&#x6700;&#x9AD8;&#x6BD4;&#x4F8B;&#x6B63;&#x786E;&#x89E3;&#x91CA;&#x7684;&#x6A21;&#x578B;&#x4E0A;&#xFF0C;&#x6211;&#x8BC1;&#x660E;&#x4E86;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F5C;&#x4E3A;&#x5F15;&#x5165;&#x7684;&#x6846;&#x67B6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x89E3;&#x51B3;&#x4E86;&#x4F7F;&#x7528;&#x5B8C;&#x6574;&#x76EE;&#x6807;&#x5E8F;&#x5217;&#x8FDB;&#x884C;&#x5BF9;&#x6297;&#x6027;&#x653B;&#x51FB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x4EE5;&#x524D;&#x5728;&#x5E8F;&#x5217;&#x5230;&#x5E8F;&#x5217;&#x653B;&#x51FB;&#x4E2D;&#x6CA1;&#x6709;&#x7814;&#x7A76;&#x8FC7;&#xFF0C;&#x5B83;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x4EFB;&#x52A1;&#x53EF;&#x80FD;&#x5F88;&#x6709;&#x7528;&#x3002;</p>
<p>&#x200B;        &#x9A8C;&#x8BC1;&#x7531;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x4EA7;&#x751F;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x60AC;&#x800C;&#x672A;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x672C;&#x6587;&#x5F15;&#x5165;&#x7684;&#x5BF9;&#x6297;&#x6027;&#x6846;&#x67B6;&#x68C0;&#x9A8C;&#x6A21;&#x578B;&#x662F;&#x5426;&#x80FD;&#x4EA7;&#x751F;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x4E0D;&#x4E00;&#x81F4;&#x662F;&#x7531;&#x4E8E;&#x4E0D;&#x8BDA;&#x5B9E;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x8FD8;&#x662F;&#x7531;&#x4E8E;&#x6A21;&#x578B;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x7814;&#x7A76;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x672A;&#x6765;&#x5EFA;&#x7ACB;&#x66F4;&#x7A33;&#x5065;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x89E3;&#x91CA;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x975E;&#x5E38;&#x6709;&#x4EF7;&#x503C;&#x3002;&#x6211;&#x7684;&#x5E0C;&#x671B;&#x662F;&#xFF0C;&#x5728;&#x672A;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x6709;&#x5F3A;&#x5927;&#x548C;&#x51C6;&#x786E;&#x7684;&#x795E;&#x7ECF;&#x6A21;&#x578B;&#xFF0C;&#x5FE0;&#x5B9E;&#x5730;&#x89E3;&#x91CA;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../第六章/第六章.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第六章 验证产生自然语言解释的神经网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第七章 一般结论和观点","level":"8.1","depth":1,"previous":{"title":"第六章 验证产生自然语言解释的神经网络","level":"7.1","depth":1,"path":"第六章/第六章.md","ref":"第六章/第六章.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","splitter","expandable-chapters-small","anchors","github","github-buttons","donate","sharing-plus","anchor-navigation-ex","favicon","mathjax-pro","livereload"],"styles":{"website":"./styles/website.css"},"pluginsConfig":{"pluginsConfig":{"summary":{"excludeDir":["image"],"readme":"README.md","summary":"SUMMARY.md","introduction":{"title":"introduction","file":"README.md"}}},"github":{"url":"https://github.com/Blankj"},"livereload":{},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"donate":{"alipay":"./source/images/donate.png","alipayText":" ","button":"赞赏","title":"","wechat":"","wechatText":"微信打赏"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"favicon":{"shortcut":"./source/images/favicon.jpg","bookmark":"./source/images/favicon.jpg","appleTouch":"./source/images/apple-touch-icon.jpg","appleTouchMore":{"120x120":"./source/images/apple-touch-icon.jpg","180x180":"./source/images/apple-touch-icon.jpg"}},"github-buttons":{"buttons":[{"user":"Blankj","repo":"glory","type":"star","size":"small","count":true}]},"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"expandable-chapters-small":{},"sharing":{"qq":false,"all":["google","facebook","weibo","twitter","qq","qzone","linkedin","pocket"],"douban":false,"facebook":false,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{}},"theme":"default","author":"Blankj","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Blankj's Glory","language":"zh-hans","links":{"sidebar":{"我的狗窝":"https://blankj.com"}},"gitbook":"3.2.3","description":"select * from learn"},"file":{"path":"第七章/第七章.md","mtime":"2020-10-23T10:09:47.250Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-23T12:59:43.801Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

