
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三章 基于特征解释的难点和主观性 · Blankj's Glory</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Blankj">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../第四章/第四章.html" />
    
    
    <link rel="prev" href="../第二章/第二章.html" />
    

    
        <link rel="shortcut icon" href='../source/images/favicon.jpg' type="image/x-icon">
    
    
        <link rel="bookmark" href='../source/images/favicon.jpg' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='../source/images/apple-touch-icon.jpg'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="../source/images/apple-touch-icon.jpg">
        
        <link rel="apple-touch-icon" sizes="180x180" href="../source/images/apple-touch-icon.jpg">
        
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"Blankj","repo":"glory","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://blankj.com" target="_blank" class="custom-link">我的狗窝</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">摘要</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../摘要/Abstract.html">
            
                <a href="../摘要/Abstract.html">
            
                    
                    摘要
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第一章</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../第一章/第一章.html">
            
                <a href="../第一章/第一章.html">
            
                    
                     简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二章</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../第二章/第二章.html">
            
                <a href="../第二章/第二章.html">
            
                    
                    第二章  深度神经网络解释的背景知识
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三章</li>
        
        
    
        <li class="chapter active" data-level="4.1" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章 基于特征解释的难点和主观性
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四章</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../第四章/第四章.html">
            
                <a href="../第四章/第四章.html">
            
                    
                    第四章 验证基于特征的事后解释方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五章</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../第五章/第五章.html">
            
                <a href="../第五章/第五章.html">
            
                    
                    第五章 生成自然语言解释的神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第六章</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="../第六章/第六章.html">
            
                <a href="../第六章/第六章.html">
            
                    
                    第六章 验证产生自然语言解释的神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第七章</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="../第七章/第七章.html">
            
                <a href="../第七章/第七章.html">
            
                    
                    第七章 一般结论和观点
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第三章 基于特征解释的难点和主观性</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#&#x7B2C;&#x4E09;&#x7AE0;-&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;"><b></b>&#x7B2C;&#x4E09;&#x7AE0; &#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;</a></li><ul><li><span class="title-icon "></span><a href="#31-&#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5668;"><b></b>3.1 &#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5668;</a></li><ul><li><span class="title-icon "></span><a href="#311-&#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;"><b></b>3.1.1 &#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;</a></li></ul><li><span class="title-icon "></span><a href="#32-&#x4FE1;&#x4EFB;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;"><b></b>3.2 &#x4FE1;&#x4EFB;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;</a></li><li><span class="title-icon "></span><a href="#33-&#x7ED3;&#x8BBA;&#x548C;&#x5F00;&#x653E;&#x5F0F;&#x95EE;&#x9898;"><b></b>3.3 &#x7ED3;&#x8BBA;&#x548C;&#x5F00;&#x653E;&#x5F0F;&#x95EE;&#x9898;</a></li></ul></ul></div><a href="#&#x7B2C;&#x4E09;&#x7AE0;-&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="&#x7B2C;&#x4E09;&#x7AE0;-&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;"><a name="&#x7B2C;&#x4E09;&#x7AE0;-&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;" class="anchor-navigation-ex-anchor" href="#&#x7B2C;&#x4E09;&#x7AE0;-&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;"><i class="fa fa-link" aria-hidden="true"></i></a><a name="&#x7B2C;&#x4E09;&#x7AE0;-&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;" class="plugin-anchor" href="#&#x7B2C;&#x4E09;&#x7AE0;-&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7B2C;&#x4E09;&#x7AE0; &#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x89E3;&#x91CA;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4E3B;&#x89C2;&#x6027;</h1>
<p>&#x672C;&#x8BBA;&#x6587;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x4E4B;&#x4E00;&#x662F;&#x9A8C;&#x8BC1;&#x89E3;&#x91CA;&#x662F;&#x5426;&#x5FE0;&#x5B9E;&#x5730;&#x63CF;&#x8FF0;&#x4E86;&#x5B83;&#x4EEC;&#x6240;&#x8981;&#x89E3;&#x91CA;&#x7684;&#x6A21;&#x578B;&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#x6765;&#x9A8C;&#x8BC1;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x4E8B;&#x540E;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x6240;&#x63D0;&#x4F9B;&#x89E3;&#x91CA;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x3002;&#x8981;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x6311;&#x6218;&#x662F;&#x5B9A;&#x4E49;&#x4EC0;&#x4E48;&#x662F;&#x5FE0;&#x5B9E;&#x7684;&#x57FA;&#x4E8E;&#x7279;&#x6027;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x7684;3.1&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C55;&#x793A;&#x4E86;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x6A21;&#x578B;&#x548C;&#x5B9E;&#x4F8B;&#xFF0C;&#x5B58;&#x5728;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x503C;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x89E3;&#x91CA;(&#x6216;&#x89E3;&#x91CA;&#x5668;)&#x7684;&#x5FE0;&#x5B9E;&#x7A0B;&#x5EA6;&#x53D6;&#x51B3;&#x4E8E;&#x5B9E;&#x8DF5;&#x4E2D;&#x6240;&#x504F;&#x597D;&#x7684;&#x57FA;&#x7840;&#x771F;&#x5B9E;&#x89E3;&#x91CA;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x200B;        &#x6B64;&#x5916;&#xFF0C;&#x6211;&#x6307;&#x51FA;&#x4E24;&#x79CD;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x5373;Shapley&#x89E3;&#x91CA;&#x5668;&#x548C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x771F;&#x5B9E;&#x503C;&#x89E3;&#x91CA;&#x3002;&#x6211;&#x8FD8;&#x8BC1;&#x660E;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4E0D;&#x8DB3;&#x4EE5;&#x63D0;&#x4F9B;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x7684;&#x5B8C;&#x6574;&#x89C6;&#x56FE;&#x3002;&#x636E;&#x6211;&#x6240;&#x77E5;&#xFF0C;&#x6587;&#x732E;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x5F3A;&#x8C03;&#x53EF;&#x80FD;&#x6709;&#x4E0D;&#x6B62;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x503C;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5F3A;&#x8C03;&#x6BCF;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x90FD;&#x575A;&#x6301;&#x54EA;&#x4E00;&#x79CD;&#x57FA;&#x7840;&#x771F;&#x5B9E;&#x503C;&#x89E3;&#x91CA;&#x3002;&#x7136;&#x800C;,&#x8FD9;&#x4E9B;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x4E8E;&#x7528;&#x6237;,&#x9009;&#x62E9;&#x6700;&#x9002;&#x5408;&#x4ED6;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x548C;&#x89E3;&#x91CA;&#x6B63;&#x786E;&#x7684;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x5BF9;&#x4E8E;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x544A;&#x8BC9;&#x7528;&#x6237;&#x9884;&#x671F;&#x884C;&#x4E3A;&#x3001;&#x4F18;&#x70B9;&#xFF0C;&#x548C;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x5C40;&#x9650;&#x6027;,&#x4EE5;&#x53CA;&#x63D0;&#x4F9B;&#x516C;&#x5E73;&#x7684;&#x81EA;&#x52A8;&#x8BC4;&#x4F30;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x8457;&#x4F5C;&#x4F3C;&#x4E4E;&#x6697;&#x793A;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x503C;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x662F;&#x6240;&#x6709;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x200B;        &#x5728;&#x9A8C;&#x8BC1;&#x89E3;&#x91CA;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x65F6;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6311;&#x6218;&#x7684;&#x65B9;&#x9762;&#x6070;&#x6070;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;:&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x795E;&#x7ECF;&#x6A21;&#x578B;&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x672C;&#x7AE0;&#x7684;3.2&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x7814;&#x7A76;&#x4E86;&#x671F;&#x671B;&#x63D0;&#x4F9B;&#x5FE0;&#x5B9E;&#x89E3;&#x91CA;&#x7684;&#x57FA;&#x4E8E;&#x7279;&#x6027;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x5728;&#x591A;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x786E;&#x5B9E;&#x505A;&#x5230;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x8FD9;&#x7C7B;&#x6A21;&#x578B;&#x5C06;&#x5728;&#x7B2C;4&#x7AE0;&#x4E2D;&#x4F5C;&#x4E3A;&#x9A8C;&#x8BC1;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x9A8C;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x200B;        &#x672C;&#x7AE0;&#x7684;&#x53D1;&#x73B0;&#x90E8;&#x5206;&#x57FA;&#x4E8E;(Camburu et al.&#xFF0C; 2019)&#xFF0C;&#x4E0D;&#x4EC5;&#x662F;&#x6211;&#x5C06;&#x5728;&#x7B2C;4&#x7AE0;&#x4ECB;&#x7ECD;&#x7684;&#x9A8C;&#x8BC1;&#x6846;&#x67B6;&#x7684;&#x91CD;&#x8981;&#x57FA;&#x7840;&#xFF0C;&#x800C;&#x4E14;&#x5C31;&#x5176;&#x672C;&#x8EAB;&#x800C;&#x8A00;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6307;&#x5411;&#x4E86;&#x53EF;&#x89E3;&#x91CA;&#x6027;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x9762;&#x3002;</p>
<p>&#x200B;        <strong>&#x8BF4;&#x660E;&#x4F8B;&#x5B50;</strong>  &#x5728;&#x6DF1;&#x5165;&#x672C;&#x7AE0;&#x7684;&#x6838;&#x5FC3;&#x5185;&#x5BB9;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5411;&#x8BFB;&#x8005;&#x4ECB;&#x7ECD;&#x4E86;&#x6211;&#x5C06;&#x5728;&#x4EE5;&#x540E;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x66F4;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x6211;&#x5C06;&#x4F7F;&#x7528;&#x5047;&#x8BBE;&#x6A21;&#x578B;&#x6765;&#x8FDB;&#x884C;&#x6587;&#x672C;&#x60C5;&#x7EEA;&#x5206;&#x6790;&#xFF0C;&#x4EE5;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x672C;&#x7AE0;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x5C06;&#x8BC4;&#x8BBA;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x6BB5;&#x5305;&#x542B;&#x5BF9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x610F;&#x89C1;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x5E76;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5206;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x6570;&#x53CD;&#x6620;&#x4E86;&#x8BC4;&#x8BBA;&#x5BF9;&#x8BE5;&#x5BF9;&#x8C61;&#x6216;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x770B;&#x6CD5;&#x3002;&#x8BE5;&#x4EFB;&#x52A1;&#x662F;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7A81;&#x51FA;&#x4EFB;&#x52A1;&#xFF0C;&#x5177;&#x6709;&#x91CD;&#x8981;&#x7684;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x5E94;&#x7528;(McAuley et al.&#xFF0C; 2012;Maas&#x7B49;&#xFF0C;2011)&#x3002;&#x4E0E;Lei et al.(2016)&#x7C7B;&#x4F3C;&#xFF0C;&#x6211;&#x5C06;&#x4EFB;&#x52A1;&#x89C6;&#x4E3A;&#x56DE;&#x5F52;&#xFF0C;&#x5F97;&#x5206;&#x4E3A;&#x4E00;&#x4E2A;&#x5B9E;&#x6570;&#xFF0C;&#x7EBF;&#x6027;&#x53CD;&#x6620;&#x60C5;&#x7EEA;&#x7684;&#x5F3A;&#x5EA6;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;-1&#x662F;&#x6700;&#x8D1F;&#x7684;&#x5206;&#x6570;&#xFF0C;1&#x662F;&#x6700;&#x6B63;&#x7684;&#x5206;&#x6570;&#xFF0C;&#x56E0;&#x6B64;0&#x4EE3;&#x8868;&#x4E2D;&#x7ACB;&#x7684;&#x5206;&#x6570;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x5DEE;&#x5F02;&#x81F3;&#x5C11;&#x4E3A;0.1&#x624D;&#x663E;&#x8457;&#x3002;&#x60C5;&#x7EEA;&#x5206;&#x6790;&#x4EFB;&#x52A1;&#x7684;&#x4E00;&#x79CD;&#x91CD;&#x8981;&#x7C7B;&#x578B;&#x662F;&#x5728;&#x591A;&#x65B9;&#x9762;&#x56DE;&#x987E;&#x4E2D;&#x8BC6;&#x522B;&#x5BF9;&#x67D0;&#x4E00;&#x65B9;&#x9762;&#x7684;&#x60C5;&#x7EEA;&#x3002;</p>
<p><img src="../image/3.1.png" alt=""></p>
<p>&#x56FE;3.1:Shapley&#x89E3;&#x91CA;&#x5668;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#x5206;&#x522B;&#x7ED9;&#x51FA;&#x81F3;&#x5C11;&#x4E24;&#x4E2A;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x7684;&#x4F8B;&#x5B50;&#x3002;Shapley&#x503C;&#x7531;&#x5F0F;2.3&#x8BA1;&#x7B97;&#x3002;&#x5047;&#x8BBE;&#x5206;&#x6570;&#x662F;&#x7EBF;&#x6027;&#x53CD;&#x6620;&#x60C5;&#x7EEA;&#x7684;&#x5F3A;&#x5EA6;&#xFF0C;0.1&#x7684;&#x5DEE;&#x5F02;&#x662F;&#x663E;&#x8457;&#x7684;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5305;&#x542B;&#x5BF9;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x591A;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x610F;&#x89C1;&#x7684;&#x7EFC;&#x8FF0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;BeerAdvocate&#x6570;&#x636E;&#x96C6;(McAuley et al.&#xFF0C; 2012)&#x5305;&#x542B;&#x4E86;&#x4EBA;&#x7C7B;&#x64B0;&#x5199;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x6DB5;&#x76D6;&#x4E86;&#x5564;&#x9152;&#x7684;&#x56DB;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x5373;&#x5916;&#x89C2;&#x3001;&#x53E3;&#x611F;&#x3001;&#x5473;&#x9053;&#x548C;&#x6C14;&#x5473;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x4F7F;&#x7528;&#x51E0;&#x4E2A;&#x5047;&#x8BBE;&#x6A21;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x8FDB;&#x884C;&#x6574;&#x4F53;&#x548C;&#x591A;&#x65B9;&#x9762;&#x7684;&#x60C5;&#x7EEA;&#x5206;&#x6790;&#x4F5C;&#x4E3A;&#x4F8B;&#x8BC1;&#x3002;</p>
<h2 id="31-&#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5668;"><a name="31-&#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5668;" class="anchor-navigation-ex-anchor" href="#31-&#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5668;"><i class="fa fa-link" aria-hidden="true"></i></a><a name="31-&#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5668;" class="plugin-anchor" href="#31-&#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5668;"><i class="fa fa-link" aria-hidden="true"></i></a>3.1 &#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5668;</h2>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x5C55;&#x793A;&#x4E00;&#x4E9B;&#x6A21;&#x578B;&#x548C;&#x5B9E;&#x4F8B;&#x7684;&#x6848;&#x4F8B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6848;&#x4F8B;&#x4E2D;&#x5B58;&#x5728;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x503C;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x6211;&#x8FD8;&#x5C55;&#x793A;&#x4E86;&#x4E24;&#x7C7B;&#x6D41;&#x884C;&#x7684;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x4ED6;&#x4EEC;&#x5404;&#x81EA;&#x63D0;&#x5021;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x5B9E;&#x57FA;&#x7840;&#x89E3;&#x91CA;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x63D0;&#x53CA;&#x3002;&#x636E;&#x6211;&#x6240;&#x77E5;&#xFF0C;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x7684;&#x6587;&#x732E;&#x4E2D;&#x8FD8;&#x6CA1;&#x6709;&#x5F3A;&#x8C03;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x76EE;&#x524D;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x8457;&#x4F5C;&#x4F3C;&#x4E4E;&#x6697;&#x793A;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x9884;&#x6D4B;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x503C;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x7528;&#x6237;&#x548C;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x90FD;&#x5FC5;&#x987B;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E9B;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x200B;        &#x6B64;&#x540E;&#xFF0C;&#x6211;&#x5C06;&#x628A;&#x660E;&#x786E;&#x65E8;&#x5728;&#x63D0;&#x4F9B;Shapley&#x503C;&#x4F5C;&#x4E3A;&#x89E3;&#x91CA;&#x7684;&#x4EFB;&#x4F55;&#x89E3;&#x91CA;&#x5668;&#x6807;&#x8BB0;&#x4E3A;Shapley&#x89E3;&#x91CA;&#x5668;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C;2&#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF0C;Lundberg 27&#x548C;Lee(2017)&#x8BA4;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x7279;&#x5F81;&#x52A0;&#x6027;&#x89E3;&#x91CA;&#x5668;&#x90FD;&#x5E94;&#x8BE5;&#x4EE5;Shapley&#x503C;&#x4F5C;&#x4E3A;&#x89E3;&#x91CA;&#x7684;&#x76EE;&#x6807;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x9274;&#x4E8E;&#x672C;&#x7AE0;&#x7684;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x60F3;&#x5141;&#x8BB8;&#x7279;&#x5F81;&#x52A0;&#x6027;&#x89E3;&#x91CA;&#x5668;&#x575A;&#x6301;&#x4E0D;&#x540C;&#x7684;&#x89C2;&#x70B9;&#x3002;</p>
<p>&#x200B;        &#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x771F;&#x5B9E;&#x5B58;&#x5728;&#x7684;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x89E3;&#x91CA;&#x9884;&#x6D4B;&#x6A21;&#x578B;,&#x5728;&#x56FE;3.1&#x4E2D;,&#x6211;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x5047;&#x8BBE;&#x7684;&#x4F8B;&#x5B50;&#x60C5;&#x7EEA;&#x5206;&#x6790;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x3002;&#x8BE5;&#x6A21;&#x578B;&#x4F7F;&#x5176;&#x9884;&#x6D4B;&#x5982;&#x4E0B;:&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x201C;very good&#x201D;&#x5728;&#x8F93;&#x5165;&#x6587;&#x672C;&#x7684;&#x5B58;&#x5728;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x79EF;&#x6781;&#x7684;&#x5F97;&#x5206;&#x4E3A;0.9&#x5206;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x201C;very good&#x201D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8F93;&#x5165;&#x6587;&#x672C;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x201C;nice&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x4E86;0.7&#x7684;&#x79EF;&#x6781;&#x60C5;&#x7EEA;&#x3002;&#x5982;&#x679C;&#x8F93;&#x5165;&#x6587;&#x672C;&#x4E2D;&#x65E2;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x201C;very good&#x201D;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x201C;nice&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x6A21;&#x578B;&#x5C31;&#x4F1A;&#x7ED9;&#x51FA;0.6&#x5206;&#xFF0C;&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x79EF;&#x6781;&#x6307;&#x6807;&#x90FD;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#xFF0C;&#x90A3;&#x4E48;&#x6A21;&#x578B;&#x5C31;&#x4F1A;&#x9ED8;&#x8BA4;&#x5F97;&#x5230;&#x4E2D;&#x6027;&#x7684;0&#x5206;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5176;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x7684;&#x7B80;&#x5355;&#x6A21;&#x578B;&#x3002;&#x5C06;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5E94;&#x7528;&#x5230;&#x5B9E;&#x4F8B;$x<em>{(1)}$&#x4E0A;:&#x201C;The movie was good, it was actually nice.&quot;&#x3002;&#xFF0C;&#x6A21;&#x578B;&#x9884;&#x6D4B;$m(x</em>{(1)})$ = 0.7&#xFF0C;&#x56E0;&#x4E3A;&#x201C;nice&#x201D;&#x51FA;&#x73B0;&#x5728;&#x8F93;&#x5165;&#x5B9E;&#x4F8B;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x201C;nice&#x201D;&#x662F;0.7&#x7684;&#x9884;&#x6D4B;&#x4E2D;&#x552F;&#x4E00;&#x91CD;&#x8981;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x800C;&#x201C;good&#x201D;&#x5219;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;(0.6)&#x4E2D;&#x552F;&#x4E00;&#x91CD;&#x8981;&#x7684;&#x7279;&#x6027;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x8FA9;&#x79F0;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x9884;&#x6D4B;&#xFF0C;&#x201C;good&#x201D;&#x4E5F;&#x5FC5;&#x987B;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x539F;&#x56E0;&#x5982;&#x4E0B;:&#x5982;&#x679C;&#x8981;&#x53D6;&#x6D88;&#x201C;good&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x6A21;&#x578B;&#x5C06;&#x4F9D;&#x8D56;&#x201C;good&#x201D;&#x7ED9;&#x51FA;&#x9AD8;&#x8FBE;0.6&#x7684;&#x5206;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F4E;&#x5F97;&#x591A;&#x7684;0&#x5206;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5BF9;&#x4E8E;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x89E3;&#x91CA;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5373;&#x4F7F;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E5F;&#x6709;&#x4E24;&#x79CD;&#x540C;&#x6837;&#x6709;&#x6548;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x9009;&#x62E9;&#x54EA;&#x79CD;&#x89C6;&#x89D2;&#x662F;&#x4E3B;&#x89C2;&#x7684;&#x3002;</p>
<p>&#x200B;        &#x5F53;&#x8BD5;&#x56FE;&#x7528;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x6765;&#x89E3;&#x91CA;&#x6A21;&#x578B;$m$&#x65F6;&#x6240;&#x9762;&#x4E34;&#x7684;&#x56F0;&#x96BE;&#x5728;&#x5B9E;&#x4F8B;$x<em>{(2)}$&#x4E0A;&#x66F4;&#x52A0;&#x660E;&#x663E;:&#x201C;The movie was nice, in fact, it was very good.&#x201D;&#x6A21;&#x578B;&#x9884;&#x6D4B;$m(x</em>{(2)}) = 0.9$&#xFF0C;&#x56E0;&#x4E3A;&#x201C;very good&#x201D;&#x662F;&#x8F93;&#x5165;&#x5B9E;&#x4F8B;&#x7684;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7279;&#x5F81;&#x201C;very good&#x201D;&#x548C;&#x201C;good&#x201D;&#x6784;&#x6210;&#x4E86;&#x5BF9;&#x8FD9;&#x4E2A;&#x9884;&#x6D4B;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x4E8B;&#x5B9E;&#x89E3;&#x91CA;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x201C;good&#x201D;&#x88AB;&#x5254;&#x9664;&#xFF0C;&#x6A21;&#x578B;&#x4F9D;&#x8D56;&#x4E8E;&#x201C;nice&#x201D;(&#x800C;&#x4E0D;&#x662F;&#x201C;very&#x201D;)&#x6765;&#x63D0;&#x4F9B;&#x9AD8;&#x8FBE;0.7&#x7684;&#x5206;&#x6570;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x201C;good&#x201D;&#x548C;&#x201C;nice&#x201D;&#x90FD;&#x88AB;&#x5254;&#x9664;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x6570;&#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x4E0B;&#x964D;&#x5230;0&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x201C;nice&#x201D;&#x53EF;&#x4EE5;&#x88AB;&#x89C6;&#x4E3A;&#x6BD4;&#x201C;very&#x201D;&#x66F4;&#x91CD;&#x8981;&#xFF0C;&#x6309;&#x7167;&#x91CD;&#x8981;&#x6027;&#x987A;&#x5E8F;&#x63D0;&#x4F9B;&#x201C;good&#x201D;&#x3001;&#x201C;nice&#x201D;&#x3001;&#x201C;very&#x201D;&#x7684;&#x89E3;&#x91CA;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x503C;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x3002;</p>
<p>&#x200B;        <strong>Shapley&#x503C;&#x4E0E;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;</strong>&#x3002;&#x4E0A;&#x9762;&#x63CF;&#x8FF0;&#x7684;&#x4E24;&#x79CD;&#x57FA;&#x672C;&#x771F;&#x5B9E;&#x89E3;&#x91CA;&#x662F;&#x7531;Shapley&#x503C;&#x548C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#x8FD9;&#x4E24;&#x7C7B;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x5206;&#x522B;&#x5021;&#x5BFC;&#x7684;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;Shapley &#x89E3;&#x91CA;&#x5668; (Lundberg and Lee, 2017)&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;$x^{(1)}$&#x4E0A;&#xFF0C;&#x201C;nice&#x201D;&#x662F;&#x8BE5;&#x6A21;&#x578B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6743;&#x91CD;&#x4E3A;0.4&#xFF0C;&#x4F46;&#x201C;good&#x201D;&#x7684;&#x663E;&#x8457;&#x8D21;&#x732E;&#x4E3A;0.3(&#x89C1;&#x516C;&#x5F0F;2.3)&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#x53D1;&#x73B0;&#x53EA;&#x6709;&#x201C;nice&#x201D;&#x7279;&#x6027;&#x662F;&#x91CD;&#x8981;&#x7684;(&#x89C1;&#x516C;&#x5F0F;2.4&#x548C;2.5)&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5BF9;&#x4E8E;&#x6A21;&#x578B;$m$&#x5BF9;&#x5B9E;&#x4F8B;$x_{(2)}$&#x7684;&#x9884;&#x6D4B;&#xFF0C;Shapley&#x89E3;&#x91CA;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x201C;good&#x201D;&#x548C;&#x201C;nice&#x201D;&#x662F;&#x4E24;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x91CD;&#x8981;&#x6027;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#xFF0C;&#x800C;&#x201C;very&#x201D;&#x7684;&#x91CD;&#x8981;&#x6027;&#x5927;&#x7EA6;&#x662F;&#x201C;nice&#x201D;&#x7684;&#x4E09;&#x500D;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x7684;&#x89C2;&#x70B9;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x4E24;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7279;&#x6027;&#x662F;&#x201C;good&#x201D;&#x548C;&#x201C;very&#x201D;&#xFF0C;&#x800C;&#x201C;nice&#x201D;&#x6839;&#x672C;&#x4E0D;&#x4F1A;&#x88AB;&#x63D0;&#x5230;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x200B;        &#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x771F;&#x5B9E;&#x503C;&#x89E3;&#x91CA;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x4E0E; Shapley &#x503C;&#x4E00;&#x81F4;&#x7684;&#x89E3;&#x91CA;&#x65E8;&#x5728;&#x4E3A;&#x5B9E;&#x4F8B;&#x90BB;&#x57DF;&#x7684;&#x8981;&#x7D20;&#x63D0;&#x4F9B;<em>&#x5E73;&#x5747;&#x91CD;&#x8981;&#x6027;&#x6743;&#x91CD;</em> &#xFF0C;&#x800C;&#x4E0E;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x5BF9;&#x9F50;&#x7684;&#x89E3;&#x91CA;&#x65E8;&#x5728;&#x63D0;&#x4F9B;&#x6A21;&#x578B;&#x5728;&#x5B9E;&#x4F8B;&#x5355;&#x72EC;&#x4E0A;&#x4F7F;&#x7528;&#x7684;&#x70B9;&#x6001;&#x7279;&#x6027;&#x3002;Shapley&#x503C;&#x6765;&#x81EA;&#x5408;&#x4F5C;&#x535A;&#x5F08;&#x8BBA;(Shapley, 1951)&#xFF0C;&#x5B83;&#x7684;&#x5F15;&#x5165;&#x662F;&#x4E3A;&#x4E86;&#x4FC3;&#x8FDB;&#x5728;&#x53C2;&#x4E0E;&#x8005;&#x4E4B;&#x95F4;&#x5206;&#x914D;&#x8054;&#x76DF;&#x603B;&#x6536;&#x76CA;&#x7684;&#x516C;&#x5E73;&#x6027;&#x3002;&#x8FD9;&#x5C31;&#x662F;Shapley&#x503C;&#x901A;&#x8FC7;&#x65B9;&#x7A0B;2.2&#x4E2D;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x6761;&#x4EF6;&#x8003;&#x8651;&#x73A9;&#x5BB6;&#x5728;&#x4EFB;&#x610F;&#x5B50;&#x8054;&#x76DF;&#x4E2D;&#x7684;&#x8868;&#x73B0;&#x80FD;&#x529B;&#x7684;&#x539F;&#x56E0;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89C6;&#x89D2;&#x53EA;&#x5956;&#x52B1;&#x5B8C;&#x5168;&#x5FC5;&#x8981;&#x7684;&#x8054;&#x76DF;&#x5185;&#x7684;&#x73A9;&#x5BB6;&#x3002;&#x5728;&#x56FE;3.1&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x6A21;&#x578B;$m$&#xFF0C;&#x201C;nice&#x201D;&#x5728;&#x201C;very&#x201D;&#x548C;&#x201C;good&#x201D;&#x76F8;&#x90BB;&#x51FA;&#x73B0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x201C;nice&#x201D;&#x5355;&#x72EC;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x53EF;&#x89C2;&#x7684;0.7&#x5206;&#x3002;</p>
<p>&#x200B;        &#x5728;&#x6B64;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5C06;&#x628A;&#x8FD9;&#x4E24;&#x79CD;&#x771F;&#x5B9E;&#x503C;&#x89E3;&#x91CA;&#x5206;&#x522B;&#x79F0;&#x4E3A;&#x90BB;&#x57DF;&#x89E3;&#x91CA;&#x548C;&#x70B9;&#x6001;&#x89E3;&#x91CA;&#x3002;&#x8FD9;&#x4E9B;&#x540D;&#x5B57;&#x662F;&#x4E3A;&#x4E86;&#x771F;&#x5B9E;&#x53CD;&#x6620;&#x8FD9;&#x4E24;&#x4E2A;&#x89E3;&#x91CA;&#x7684;&#x9AD8;&#x5C42;&#x6839;&#x672C;&#x533A;&#x522B;,&#x5BF9;m&#x5173;&#x4E8E;$x^{(2)}$&#x7684;&#x9884;&#x6D4B;,&#x5982;&#x8003;&#x8651;&#x201C;nice&#x201D;&#x662F;&#x6BD4;&#x201C;very&#x201D;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E0E;&#x8003;&#x8651;&#x201C;nice&#x201D;&#x4F5C;&#x4E3A;&#x89E3;&#x91CA;&#x662F;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F4E;&#x5C42;&#x6B21;&#x7684;&#x5DEE;&#x5F02;,&#x5982;&#x5177;&#x4F53;&#x7684;Shapley&#x503C;&#x6743;&#x91CD;&#x6216;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x63D0;&#x4F9B;&#x5B50;&#x4F5C;&#x4E3A;&#x89E3;&#x91CA;&#x800C;&#x4E0D;&#x662F;&#x6743;&#x91CD;&#xFF0C;&#x6211;&#x5C06;&#x660E;&#x786E;&#x5730;&#x79F0;&#x4E3A;Shapley&#x89E3;&#x91CA;(&#x6216;Shapley explainer)&#x548C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;(&#x6216;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;)&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x6DF7;&#x6DC6;&#x3002;</p>
<p><strong>&#x4E0D;&#x603B;&#x662F;&#x533A;&#x5206;&#x3002;</strong> &#x5C3D;&#x7BA1;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x6A21;&#x578B;&#x548C;&#x5B9E;&#x4F8B;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x771F;&#x5B9E;&#x503C;&#x89E3;&#x91CA;&#x662F;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x4F46;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x578B;$m$&#xFF0C;&#x4F46;&#x662F;&#x5E94;&#x7528;&#x4E8E;&#x53EA;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x5B50;&#x77ED;&#x8BED;&#x201C;very good&#x201D;&#x3001;&#x201C;nice&#x201D;&#x548C;&#x201C;good&#x201D;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x4F8B;&#x5982;&#x201C;The movie was good&#x201D;&#x3002;&#x90BB;&#x57DF;&#x89E3;&#x91CA;&#x548C;&#x70B9;&#x6001;&#x89E3;&#x91CA;&#x90FD;&#x6307;&#x5411;&#x540C;&#x6837;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x3002;</p>
<p><strong>&#x6CA1;&#x6709;&#x5728;&#x6587;&#x732E;&#x4E2D;&#x5F3A;&#x8C03;&#x3002;</strong>&#x636E;&#x6211;&#x6240;&#x77E5;&#xFF0C;Sundararajan&#x7B49;&#x4EBA;(2017)&#x5728;&#x5B9E;&#x4F8B;$x_1= 1, x_2= 3$&#x4E0A;&#x89E3;&#x91CA;&#x51FD;&#x6570;$min(x1, x2)$&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x53EA;&#x662F;&#x7B80;&#x8981;&#x5730;&#x63D0;&#x5230;&#x4E86;&#x4E0A;&#x8FF0;&#x4E24;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x771F;&#x5B9E;&#x503C;&#x89E3;&#x91CA;&#x4E4B;&#x95F4;&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x65B9;&#x6CD5;&#x79F0;&#x4E3A;&#x7EFC;&#x5408;&#x68AF;&#x5EA6;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x91CD;&#x8981;&#x5EA6;&#x6743;&#x91CD;( $1 = min(1,3)$)&#x8D4B;&#x503C;&#x7ED9;&#x5173;&#x952E;&#x7279;&#x5F81;$x_1$(&#x56E0;&#x6B64;&#x5BF9;$x_2$&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E3A;0)&#xFF0C;&#x800C;Shapley-Shubik (Shapley and Shubik, 1971)&#x5C5E;&#x6027;&#x4E3A;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x8D4B;&#x503C;&#x4E3A;$0.5 =\frac{1}{2}min(1,3)$&#x6743;&#x91CD;&#x3002;&#x4ED6;&#x4EEC;&#x8FD8;&#x63D0;&#x5230;&#xFF0C;&#x504F;&#x7231;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x800C;&#x4E0D;&#x559C;&#x6B22;&#x53E6;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x662F;&#x4E00;&#x79CD;&#x4E3B;&#x89C2;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x200B;        &#x53E6;&#x4E00;&#x65B9;&#x9762;,&#x5979;&#x548C;&#x674E;&#x7684;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x5DE5;&#x4F5C;(2017)&#x6240;&#x793A;,&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x56FE;&#x8868;&#x7684;&#x7ED3;&#x679C;(&#x56FE;4),&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x7528;&#x6237;&#x7814;&#x7A76;&#x4E9A;&#x9A6C;&#x900A;&#x673A;&#x68B0;Turk,&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x63D0;&#x4F9B;&#x7684;&#x89E3;&#x91CA;&#x5BF9;&#x4E8E;&#x65B9;&#x6CD5;$max(x_1, x_2, x_3$) &#x5728;&#x8F93;&#x5165;&#x4E3A;$x_1 = 5, x_2 = 4, x_3 = 0$, $x1$&#x88AB;&#x8D4B;&#x4E88;3&#x7684;&#x91CD;&#x8981;&#x6027;&#x6743;&#x91CD;,$x_2$&#x88AB;&#x8D4B;&#x4E88;2&#x7684;&#x6743;&#x91CD;&#xFF0C; $x_3$&#x88AB;&#x8D4B;&#x4E88;0&#x7684;&#x6743;&#x91CD;&#x3002;&#x4F5C;&#x8005;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x7528;&#x6237;&#x7814;&#x7A76;&#x4E2D;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x6570;&#x91CF;&#x6216;&#x7279;&#x5F81;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4ED6;&#x4EEC;&#x7ED9;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x7CBE;&#x786E;&#x6307;&#x5BFC;&#x3002;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x66F4;&#x5E7F;&#x6CDB;&#x548C;&#x6709;&#x5145;&#x5206;&#x6587;&#x4EF6;&#x8BC1;&#x660E;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x4EE5;&#x5F97;&#x51FA;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x4E8B;&#x5B9E;&#x7684;&#x89E3;&#x91CA;&#x6BD4;&#x53E6;&#x4E00;&#x4E2A;&#x66F4;&#x6709;&#x7528;&#x7684;&#x7ED3;&#x8BBA;&#x3002;</p>
<p>&#x200B;    &#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x6A21;&#x5F0F;&#x53EF;&#x80FD;&#x4F1A;&#x963B;&#x788D;&#x4EBA;&#x4EEC;&#x627F;&#x8BA4;&#x4E00;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x4E8B;&#x5B9E;&#x89E3;&#x91CA;&#x4EE5;&#x53CA;Shapley&#x89E3;&#x91CA;&#x5668;&#x548C;&#x6700;&#x5C0F;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x76F4;&#x63A5;&#x6BD4;&#x8F83;&#x4E86;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x8BC6;&#x522B;&#x6A21;&#x578B;&#x7528;&#x4E8E;&#x9884;&#x6D4B;&#x7684;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4F8B;&#x5982;,&#x9648;et al&#x3002;(2018)&#x548C;Yoon et al&#x3002;(2019)&#x6BD4;&#x8F83;L2X,&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#x548C;shapley&#x65B9;&#x6CD5;(&#x5979;&#x548C;&#x674E;,2017)&#xFF0C;&#x5728;&#x5DF2;&#x77E5;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#x7684;&#x5408;&#x6210;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x7684;&#x6A21;&#x578B;&#x4F7F;&#x7528;&#x7684;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#xFF0C;&#x79F0;&#x4E3A;&#x4E8C;&#x7EF4;&#x5F02;&#x6216;&#x3001;Orange Skin&#x548C;&#x5F00;&#x5173;&#x7279;&#x5F81;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x5408;&#x6210;&#x6570;&#x636E;&#x96C6;&#x78B0;&#x5DE7;&#x6CA1;&#x6709;&#x8FDD;&#x53CD;&#x4E0A;&#x9762;&#x63CF;&#x8FF0;&#x7684;&#x4E24;&#x79CD;&#x57FA;&#x672C;&#x4E8B;&#x5B9E;&#x89E3;&#x91CA;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6BD4;&#x8F83;&#x7684;&#x65F6;&#x5019;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x6CA1;&#x6709;&#x88AB;&#x63D0;&#x53CA;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6BD4;&#x8F83;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x60F3;&#x6CD5;&#xFF0C;&#x5373;&#x6240;&#x6709;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x90FD;&#x5E94;&#x8BE5;&#x81F4;&#x529B;&#x4E8E;&#x5BFB;&#x627E;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x3002;</p>
<h3 id="311-&#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;"><a name="311-&#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;" class="anchor-navigation-ex-anchor" href="#311-&#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;"><i class="fa fa-link" aria-hidden="true"></i></a><a name="311-&#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;" class="plugin-anchor" href="#311-&#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;"><i class="fa fa-link" aria-hidden="true"></i></a>3.1.1 &#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;</h3>
<p>&#x672C;&#x8282;&#x63ED;&#x793A;&#x4E86;&#x4E0A;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x4E24;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x7684;&#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<p><strong>&#x5197;&#x4F59;&#x7279;&#x5F81;</strong>&#x3002;&#x4EC5;&#x770B;&#x56FE;3.1&#x4E2D;&#x5BF9;$m(x^1)$&#x7684;Shapley&#x89E3;&#x91CA;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x77E5;&#x9053;(1)&#x6A21;&#x578B;&#x662F;&#x5426;&#x9700;&#x8981;&#x201C;nice&#x201D;&#x548C;&#x201C;good&#x201D;&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#x6765;&#x505A;&#x51FA;0.7&#x7684;&#x9884;&#x6D4B;(m&#x4E0D;&#x662F;&#x8FD9;&#x6837;)&#xFF0C;&#x8FD8;&#x662F;(2)&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x5728;&#x5176;&#x4ED6;&#x5C5E;&#x6027;&#x5B58;&#x5728;&#x65F6;&#x662F;&#x5197;&#x4F59;&#x7684;(&#x8FD9;&#x662F;m&#x7684;&#x60C5;&#x51B5;)&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x4E0D;&#x5305;&#x542B;&#x5197;&#x4F59;&#x7279;&#x5F81;(&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F1A;&#x8FDD;&#x53CD;&#x65B9;&#x7A0B;2.5)&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;$m(x^1)$&#x7684;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x80FD;&#x591F;&#x533A;&#x5206;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p><img src="../image/3.2.png" alt="image-20201021195208340"></p>
<p>&#x56FE;3.2:&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x4E24;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x7684;&#x4F18;&#x70B9;&#x548C;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x5982;3.1.1&#x8282;&#x6240;&#x793A;&#x3002;&#x8FD9;&#x4E94;&#x4E2A;&#x89C4;&#x5219;&#x5BF9;&#x6240;&#x6709;&#x4E09;&#x79CD;&#x6A21;&#x578B;&#x90FD;&#x662F;&#x901A;&#x7528;&#x7684;&#x3002;Shapley&#x503C;&#x7531;&#x5F0F;2.3&#x8BA1;&#x7B97;&#xFF0C;&#x5E76;&#x6309;&#x5176;&#x91CD;&#x8981;&#x6027;(&#x7EDD;&#x5BF9;&#x503C;)&#x9012;&#x51CF;&#x6392;&#x5217;;&#x672A;&#x63D0;&#x53CA;&#x7684;&#x529F;&#x80FD;&#x83B7;&#x5F97;0&#x6743;&#x91CD;&#x3002;MSS&#x8868;&#x793A;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x3002;&#x5728;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x201C;amazing&#x201D;&#x7684;&#x4E0A;&#x6807;&#x533A;&#x522B;&#x4E86;&#x5B83;&#x7684;&#x4E24;&#x6B21;&#x51FA;&#x73B0;&#x3002;</p>
<p><strong>&#x53D6;&#x6D88;&#x7279;&#x5F81;&#xFF1A;&#x771F;&#x5B9E; vs &#x4EBA;&#x5DE5;</strong>&#x3002; &#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x76F8;&#x4E92;&#x62B5;&#x6D88;&#x7684;&#x7279;&#x5F81;&#x3002;&#x5728;&#x5B9E;&#x4F8B;$x^O$&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x8003;&#x8651;&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;1&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6700;&#x5C0F;&#x7684;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x662F;{&#x201C;amazing&#x201D;&#xFF0C;&#x201C;appearance&#x201D;}&#xFF0C;&#x7531;&#x4E8E;&#x516C;&#x5F0F;2.5&#xFF0C;&#x5B83;&#x4E0D;&#x5305;&#x542B;&#x7279;&#x5F81;&#x201C;bad&#x201D;&#xFF0C;&#x201C;taste&#x201D;&#xFF0C;&#x201C;good&#x201D;&#xFF0C;&#x201C;smell&#x201D;&#x3002;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x5728;&#x89E3;&#x91CA;&#x4E2D;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x88AB;&#x771F;&#x6B63;&#x53D6;&#x6D88;&#x7684;&#x7279;&#x5F81;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x88AB;Shapley&#x89E3;&#x91CA;&#x6807;&#x8BB0;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x80FD;&#x6E05;&#x695A;&#x5730;&#x8868;&#x660E;&#x201C;good smell&#x201D;&#x548C;&#x201C;bad taste&#x201D;&#x4E4B;&#x95F4;&#x7684;&#x5B8C;&#x7F8E;&#x6D88;&#x9664;&#x3002;&#x6B64;&#x5916;&#xFF0C;Shapley&#x7684;&#x89E3;&#x91CA;&#x7ED9;&#x4EBA;&#x7684;&#x5370;&#x8C61;&#x662F;&#x201C;smell&#x201D;&#x548C;&#x201C;appearance&#x201D;(0.15&#x548C;0.12)&#x6BD4;&#x201C;taste&#x201D;(0.03)&#x91CD;&#x8981;&#x5F97;&#x591A;&#xFF0C;&#x800C;$m^O$&#x901A;&#x8FC7;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E73;&#x7B49;&#x5730;&#x8003;&#x8651;&#x4E86;&#x6240;&#x6709;&#x65B9;&#x9762;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Shapley&#x548C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x90FD;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x53CD;&#x6620;$m^O(x^O)$&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x200B;        &#x5F53;&#x4ECE;&#x5B9E;&#x4F8B;&#x4E2D;&#x6D88;&#x9664;&#x7279;&#x6027;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4EBA;&#x5DE5;&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x626D;&#x66F2;&#x67D0;&#x4E9B;&#x7279;&#x6027;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x56FE;3.2&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5F53;$m^S$&#x5E94;&#x7528;&#x4E8E;$x^{S1}$&#x65F6;&#xFF0C;&#x9884;&#x6D4B;&#x503C;&#x4E3A;&#x2212;0.3&#xFF0C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x4E3A;{&#x201C;peculiar&#x201D;&#xFF0C;&#x201C;smell&#x201D;}&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x8FD9;&#x6700;&#x80FD;&#x53CD;&#x6620;$m^S(x^{S1})$&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;Shapley&#x7684;&#x89E3;&#x91CA;&#x4E2D;&#xFF0C;&#x201C;taste&#x201D;&#x4F3C;&#x4E4E;&#x6BD4;&#x201C;peculiar&#x201D;&#x91CD;&#x8981;&#x4E24;&#x500D;&#xFF0C;&#x201C;horrible&#x201D;&#x4F3C;&#x4E4E;&#x548C;&#x201C;peculiar&#x201D;&#x4E00;&#x6837;&#x91CD;&#x8981;&#xFF0C;&#x5C3D;&#x7BA1;&#x201C;peculiar&#x201D;&#x662F;&#x55C5;&#x89C9;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x7EEA;&#x6307;&#x6807;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x5B9E;&#x4F8B;$x^{S2}$&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;$m^S$&#x5E76;&#x4E0D;&#x4F9D;&#x9760;&#x5BF9;&#x5473;&#x9053;&#x7684;&#x611F;&#x89C9;&#x6765;&#x9884;&#x6D4B;&#x5BF9;&#x6C14;&#x5473;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x4F46;&#x5F53;&#x53EA;&#x6709;&#x5BF9;&#x5473;&#x9053;&#x7684;&#x611F;&#x89C9;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;Shapley&#x91CD;&#x8981;&#x6027;&#x6743;&#x91CD;&#x620F;&#x5267;&#x6027;&#x5730;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
<p><strong>&#x591A;&#x91CD;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#xFF1A;&#x771F;&#x5B9E;vs&#x4EBA;&#x5DE5;</strong>&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x56FE;3.2&#x4E2D;&#x7684;&#x6A21;&#x578B;$m^T$&#x548C;&#x5B9E;&#x4F8B;$x^{T1}$&#xFF0C;&#x7279;&#x6027;&#x201C;good&#x201D;&#x548C;&#x201C;refreshing&#x201D;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x90FD;&#x53EF;&#x4EE5;&#x5F97;&#x5230;0.6&#x5206;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#x63D0;&#x4F9B;&#x6240;&#x6709;&#x771F;&#x6B63;&#x7684;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;{&#x201C;taste&#x201D;&#xFF0C;&#x201C;good&#x201D;}&#x548C;{&#x201C;taste&#x201D;&#xFF0C;&#x201C;refreshing&#x201D;}&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BB8;&#x591A;&#x6781;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x53EA;&#x68C0;&#x7D22;&#x4E00;&#x4E2A;&#x6781;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;(Chen et al.&#xFF0C; 2018a;Yoon&#x7B49;&#xFF0C;2019)&#x3002;&#x4E00;&#x4E2A;&#x4F8B;&#x5916;&#x662F;SIS explainer (Carter et al.&#xFF0C; 2019)&#xFF0C;&#x5B83;&#x68C0;&#x7D22;&#x4E00;&#x7EC4;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x8BE6;&#x5C3D;&#x7684;(&#x4F8B;&#x5982;&#xFF0C;SIS&#x4E0D;&#x4F1A;&#x68C0;&#x7D22;$m^T(x^{T1})$&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#xFF0C;&#x56E0;&#x4E3A;&#x201C;taste&#x201D;&#x5DF2;&#x7ECF;&#x88AB;&#x7B2C;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x5360;&#x6709;)&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;shapley&#x7684;&#x89E3;&#x91CA;&#x8BA4;&#x4E3A;&#x201C;good&#x201D;&#x548C;&#x201C;refreshing&#x201D;&#x540C;&#x6837;&#x91CD;&#x8981;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5355;&#x51ED;&#x8FD9;&#x79CD;&#x89E3;&#x91CA;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x4E24;&#x8005;&#x662F;&#x5426;&#x90FD;&#x6709;&#x5FC5;&#x8981;&#x51FA;&#x73B0;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x51FA;&#x73B0;&#x662F;&#x5426;&#x5462;&#x5DE9;&#x56FA;&#x5B9E;&#x73B0;0.6&#x7684;&#x9884;&#x6D4B;&#x3002;</p>
<p>&#x200B;        &#x6D88;&#x9664;&#x7279;&#x6027;&#x65F6;&#x53D1;&#x751F;&#x7684;&#x4EBA;&#x5DE5;&#x5236;&#x54C1;&#x4E5F;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x67D0;&#x4E9B;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x51FA;&#x73B0;&#x4E3A;&#x8DB3;&#x591F;&#x7684;&#x6700;&#x5C0F;&#x5B50;&#x96C6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x56FE;3.2&#x4E2D;&#x7684;$m^Ta&#x548C;x^{T2}$&#xFF0C;&#x4E24;&#x4E2A;&#x201C;amazing&#x201D;&#x51FA;&#x73B0;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x90FD;&#x6784;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x7684;&#x6700;&#x5C0F;&#x5B50;&#x96C6;&#xFF0C;&#x4F46;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x6CA1;&#x6709;&#x53CD;&#x6620;&#x6A21;&#x578B;&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x3002;Shapley&#x89E3;&#x91CA;&#x5728;&#x8FD9;&#x4E2A;&#x6848;&#x4F8B;&#x4E2D;&#x505A;&#x51FA;&#x4E86;&#x533A;&#x522B;&#x3002;</p>
<p>&#x200B;        &#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x6765;&#x89E3;&#x91CA;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x9884;&#x6D4B;&#x3002;&#x6211;&#x786E;&#x5B9A;&#x4E86;&#x4E24;&#x79CD;&#x89E3;&#x91CA;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x79F0;&#x4E4B;&#x4E3A;&#x90BB;&#x57DF;&#x89E3;&#x91CA;&#x548C;&#x70B9;&#x6001;&#x89E3;&#x91CA;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x770B;&#x5230;&#xFF0C;Shapley&#x89E3;&#x91CA;&#x5668;&#x7684;&#x76EE;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x90BB;&#x57DF;&#x89E3;&#x91CA;&#xFF0C;&#x800C;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x8005;&#x7684;&#x76EE;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x70B9;&#x6001;&#x89E3;&#x91CA;&#x3002;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x89E3;&#x91CA;&#x548C;&#x89E3;&#x91CA;&#x5668;&#x90FD;&#x4E3A;&#x76EE;&#x6807;&#x6A21;&#x578B;&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x89C1;&#x89E3;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684;&#x957F;&#x5904;&#x548C;&#x5C40;&#x9650;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x9645;&#x7528;&#x4F8B;&#x4E2D;&#xFF0C;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x89E3;&#x91CA;&#x53EF;&#x80FD;&#x6BD4;&#x53E6;&#x4E00;&#x79CD;&#x66F4;&#x53EF;&#x53D6;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5E95;&#x5C42;&#x771F;&#x76F8;&#x7684;&#x9009;&#x62E9;&#x6700;&#x597D;&#x7559;&#x7ED9;&#x7528;&#x6237;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7528;&#x6237;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x89E3;&#x91CA;&#x548C;&#x89E3;&#x91CA;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x4F18;&#x52BF;&#x3001;&#x5C40;&#x9650;&#x6027;&#x548C;&#x5DEE;&#x5F02;&#xFF0C;&#x4EE5;&#x4FBF;&#x9009;&#x62E9;&#x548C;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x200B;        &#x6700;&#x540E;&#xFF0C;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x90BB;&#x57DF;&#x548C;&#x70B9;&#x6001;&#x89E3;&#x91CA;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x7684;&#x5B8C;&#x6574;&#x753B;&#x9762;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C06;&#x8FD9;&#x4E24;&#x79CD;&#x89E3;&#x91CA;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x7684;&#x7814;&#x7A76;&#x5C06;&#x662F;&#x4E00;&#x9879;&#x6709;&#x8DA3;&#x7684;&#x672A;&#x6765;&#x5DE5;&#x4F5C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x672A;&#x6765;&#x7684;&#x5DE5;&#x4F5C;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x4E00;&#x9879;&#x5168;&#x9762;&#x7684;&#x7528;&#x6237;&#x7814;&#x7A76;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x7528;&#x6237;&#x4ECE;&#x6BCF;&#x79CD;&#x89E3;&#x91CA;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x7EC4;&#x5408;&#x4E2D;&#x83B7;&#x76CA;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x200B;        &#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x672C;&#x90E8;&#x5206;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x5DE5;&#x4F5C;&#x9F13;&#x52B1;&#x7814;&#x7A76;&#x8005;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x4ED6;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x6240;&#x8981;&#x63D0;&#x4F9B;&#x7684;&#x89E3;&#x91CA;&#x80CC;&#x540E;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x5E76;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x76F4;&#x63A5;&#x9648;&#x8FF0;&#x5B83;&#x4EEC;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x53EF;&#x4EE5;&#x662F;&#xFF0C;&#x6BCF;&#x4E00;&#x672C;&#x4ECB;&#x7ECD;&#x89E3;&#x91CA;&#x5668;&#x6216;&#x89E3;&#x91CA;&#x5668;&#x9A8C;&#x8BC1;&#x6846;&#x67B6;&#x7684;&#x8457;&#x4F5C;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7AE0;&#x8282;&#x8BF4;&#x660E;&#xFF0C;&#x5176;&#x4E2D;&#x4F5C;&#x8005;&#x9648;&#x8FF0;&#x4E86;&#x4ED6;&#x4EEC;&#x65B9;&#x6CD5;&#x7684;&#x9884;&#x671F;&#x884C;&#x4E3A;&#x3001;&#x4F18;&#x52BF;&#x548C;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<h2 id="32-&#x4FE1;&#x4EFB;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;"><a name="32-&#x4FE1;&#x4EFB;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;" class="anchor-navigation-ex-anchor" href="#32-&#x4FE1;&#x4EFB;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;"><i class="fa fa-link" aria-hidden="true"></i></a><a name="32-&#x4FE1;&#x4EFB;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;" class="plugin-anchor" href="#32-&#x4FE1;&#x4EFB;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;"><i class="fa fa-link" aria-hidden="true"></i></a>3.2 &#x4FE1;&#x4EFB;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;</h2>
<p>&#x9A8C;&#x8BC1;&#x4E8B;&#x540E;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x53EF;&#x4FE1;&#x5EA6;&#x7684;&#x4E00;&#x79CD;&#x6F5C;&#x5728;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x4F5C;&#x4E3A;&#x5B9E;&#x9A8C;&#x5E73;&#x53F0;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E0E;&#x9884;&#x6D4B;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x7814;&#x7A76;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7C7B;&#x578B;&#x7684;&#x57FA;&#x4E8E;&#x7279;&#x6027;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x79F0;&#x4E4B;&#x4E3A;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x3002;<strong>&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x7531;&#x4E24;&#x4E2A;&#x987A;&#x5E8F;&#x6A21;&#x5757;&#x7EC4;&#x6210;:&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x5668;&#x548C;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#x5668;&#x3002;</strong>&#x9009;&#x62E9;&#x5668;&#x5BF9;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x7684;&#x5B50;&#x96C6;&#x8FDB;&#x884C;&#x786C;&#x9009;&#x62E9;&#xFF0C;&#x53EA;&#x6709;&#x9009;&#x62E9;&#x7684;&#x7279;&#x5F81;&#x88AB;&#x4F20;&#x9012;&#x7ED9;&#x9884;&#x6D4B;&#x5668;&#xFF0C;&#x9884;&#x6D4B;&#x5668;&#x8F93;&#x51FA;&#x6700;&#x7EC8;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5BF9;&#x4E8E;&#x7528;&#x4E8E;&#x5EFA;&#x6A21;&#x9009;&#x62E9;&#x5668;&#x548C;&#x9884;&#x6D4B;&#x5668;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7C7B;&#x578B;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x3002;&#x5173;&#x952E;&#x7684;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x9009;&#x62E9;&#x5668;&#x548C;&#x9884;&#x6D4B;&#x5668;&#x4E0E;&#x76D1;&#x7763;&#x4E00;&#x8D77;&#x8BAD;&#x7EC3;&#x6700;&#x7EC8;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x9009;&#x62E9;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x76D1;&#x7763;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x6027;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x975E;&#x5E38;&#x5438;&#x5F15;&#x4EBA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Lei&#x7B49;&#x4EBA;(2016)&#x3001;Yoon&#x7B49;&#x4EBA;(2019)&#x548C;Chang&#x7B49;&#x4EBA;(2019)&#x5F15;&#x5165;&#x4E86;&#x9075;&#x5FAA;&#x8FD9;&#x79CD;&#x9AD8;&#x7EA7;&#x67B6;&#x6784;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x200B;        &#x6211;&#x5C06;&#x7814;&#x7A76;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x5B9E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4F3C;&#x4E4E;&#x90FD;&#x65B9;&#x4FBF;&#x5730;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7EC4;&#x76F8;&#x5173;&#x7684;&#x7279;&#x6027;(&#x88AB;&#x9009;&#x4E2D;&#x7684;)&#x548C;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x7279;&#x6027;(&#x53EF;&#x80FD;&#x662F;&#x672A;&#x88AB;&#x9009;&#x4E2D;&#x7684;)&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F3C;&#x4E4E;&#x53EF;&#x4EE5;&#x6D4B;&#x8BD5;&#x89E3;&#x91CA;&#x5668;&#x662F;&#x5426;&#x6B63;&#x786E;&#x5730;&#x5C06;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;&#x8BC6;&#x522B;&#x4E3A;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x9762;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5FE0;&#x5B9E;&#x5730;&#x89E3;&#x91CA;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x200B;        &#x5F62;&#x5F0F;&#x4E0A;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;$D$&#x662F;&#x4E00;&#x4E2A;&#x5305;&#x542B;$x$&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5176;&#x4E2D;$x$&#x6709;$n$&#x4E2A;&#x7279;&#x5F81;$x=(x_1.x_2,...,x_n)$&#x3002;&#x4F8B;&#x5982;&#xFF0C;$x$&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#xFF0C;$x_i$&#x662F;&#x53E5;&#x5B50;&#x4E2D;&#x7684;&#x7B2C;$i$&#x4E2A;token&#x3002;&#x9009;&#x62E9;&#x5668;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;$sel(&#xB7;)$&#xFF0C;&#x8F93;&#x5165;$x$&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x7EC4;&#x7279;&#x5F81;&#x5B50;&#x96C6;$S^m_x \subseteq x$&#x3002;&#x6211;&#x4EEC;&#x5C06;$pred(&#xB7;)$&#x79F0;&#x4E3A;&#x9884;&#x6D4B;&#x5668;&#xFF0C;&#x4EC5;&#x4EC5;&#x5C06;&#x7279;&#x5F81;&#x5B50;&#x96C6;$S^m_x:=sel(x)$&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x8FD9;&#x7EC4;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x505A;&#x51FA;&#x9884;&#x6D4B;&#xFF0C;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><script type="math/tex; ">
</script></p>
<p>&#x6211;&#x4EEC;&#x628A;$N^m_x$&#x53EB;&#x505A;&#x672A;&#x9009;&#x62E9;&#x7279;&#x5F81;&#xFF0C;$N^m_x=x/S^m_x$&#x3002;</p>
<p>&#x200B;        &#x4F8B;&#x5982;,&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x89E3;&#x51B3;&#x60C5;&#x611F;&#x5206;&#x6790;&#x4EFB;&#x52A1;,&#x9009;&#x62E9;&#x5668;&#x53EA;&#x80FD;&#x5B66;&#x4F1A;&#x9009;&#x62E9;token&#x201C;amazing&#x201D;&#x5982;&#x679C;&#x8FD9;&#x4E2A;token&#x5728;&#x8F93;&#x5165;&#x6587;&#x672C;&#x4E2D;,&#x9884;&#x6D4B;&#x5668;&#x53EF;&#x80FD;&#x5B66;&#x4E60;,&#x5F53;&#x5B83;&#x63A5;&#x6536;&#x8F93;&#x5165;$S_x^m={&#x201C;amazing&#x201D;}$,&#x5B83;&#x9884;&#x6D4B;&#x6700;&#x79EF;&#x6781;&#x60C5;&#x7EEA;&#x5F97;&#x5206;&#x3002;</p>
<p><strong>&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x76EE;&#x6807;&#x5728;&#x4E8E;&#x5BF9;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x7684;&#x89E3;&#x91CA;&#x3002;</strong>&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x9F13;&#x52B1;&#x9009;&#x62E9;&#x5668;&#x505A;&#x4E00;&#x9879;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x5730;&#x8FD4;&#x56DE;&#x6240;&#x6709;&#x7279;&#x6027;(&#x9664;&#x975E;&#x5FC5;&#x8981;)&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x5316;&#x5668;&#xFF0C;&#x6839;&#x636E;&#x6240;&#x9009;&#x7279;&#x6027;&#x7684;&#x6570;&#x91CF;&#x5BF9;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x6BD4;&#x4F8B;&#x60E9;&#x7F5A;&#xFF0C;&#x5C31;&#x50CF;Lei&#x7B49;&#x4EBA;(2016)&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x516C;&#x5F0F;2.4&#x548C;2.5&#x6240;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x9009;&#x62E9;&#x5668;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x7684;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x6A21;&#x4EFF;&#x56FE;3.1&#x4E2D;&#x6A21;&#x578B;$m$&#x7684;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x7684;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x9009;&#x62E9;&#x201C;nice&#x201D;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x201C;very good&#x201D;&#x662F;&#x8F93;&#x5165;&#x7684;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x5728;&#x201C;very&#x201D;&#x548C;&#x201C;good&#x201D;&#x4E4B;&#x5916;&#x9009;&#x62E9;&#x201C;nice&#x201D;&#x5E76;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x9884;&#x6D4B;&#xFF0C;&#x4F46;&#x4F1A;&#x589E;&#x52A0;&#x6240;&#x9009;&#x7279;&#x6027;&#x7684;&#x6570;&#x91CF;&#x4E0A;&#x7684;&#x60E9;&#x7F5A;&#x3002; </p>
<p><strong>&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6700;&#x5C0F;&#x5316;</strong>  &#x867D;&#x7136;&#x6B63;&#x5219;&#x5668;&#x53EF;&#x4EE5;&#x6FC0;&#x52B1;&#x9009;&#x62E9;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x7684;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x9009;&#x62E9;&#x90A3;&#x4E9B;&#x4E0D;&#x662F;&#x9884;&#x6D4B;&#x6240;&#x4E25;&#x683C;&#x9700;&#x8981;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x6A21;&#x578B;&#x7684;&#x67E5;&#x8BE2;&#x5C0F;&#x4E8E;$O(2^{|S^m_x|)}$&#xFF0C;&#x5219;&#x68C0;&#x67E5;&#x6240;&#x9009;&#x7279;&#x5F81;&#x96C6;&#x662F;&#x5426;&#x6700;&#x5C0F;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x5F85;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x9009;&#x7279;&#x5F81;&#x7684;&#x4EFB;&#x4F55;&#x5B50;&#x96C6;&#x90FD;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x7684;&#x6700;&#x5C0F;&#x5B50;&#x96C6;&#x3002;</p>
<p>&#x200B;        &#x4ECE;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4E0D;&#x9075;&#x5B88;&#x6700;&#x4F4E;&#x9650;&#x5EA6;&#x6761;&#x4EF6;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4F8B;&#x5982;,&#x5982;&#x679C;&#x5B66;&#x4F1A;&#x4E86;&#x4F9D;&#x9760;&#x4F2A;&#x76F8;&#x5173;&#x6A21;&#x578B;,&#x6BD4;&#x5982;&#x5B66;&#x4E60;&#x8FD9;&#x4E2A;&#x8BCD;&#x201C;bottle&#x201D;&#x4EC5;&#x610F;&#x5473;&#x7740;&#x79EF;&#x6781;&#x7684;&#x60C5;&#x7EEA;,&#x5982;&#x679C;&#x6240;&#x9009;&#x7684;&#x7279;&#x5F81;&#x5305;&#x62EC;&#x771F;&#x5B9E;&#x60C5;&#x7EEA;&#x6307;&#x6570;&#x7684;&#x8BDD;,&#x90A3;&#x4E48;&#x6240;&#x9009;&#x62E9;&#x7684;&#x7279;&#x5F81;&#x6240;&#x5F62;&#x6210;&#x7684;&#x89E3;&#x91CA;&#x4F1A;&#x5BF9;&#x7528;&#x6237;&#x9690;&#x85CF;&#x6A21;&#x578B;&#x6240;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x865A;&#x5047;&#x5173;&#x8054;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6B63;&#x5982;3.1&#x8282;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x6781;&#x5C0F;&#x6027;&#x610F;&#x5473;&#x7740;&#x5C06;&#x76F8;&#x4E92;&#x62B5;&#x6D88;&#x7684;&#x7279;&#x6027;&#x89C6;&#x4E3A;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x9700;&#x8981;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6EE1;&#x8DB3;&#x6700;&#x5C0F;&#x6761;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x662F;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<p>&#x200B;        &#x4ECE;&#x9A8C;&#x8BC1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E9B;&#x88AB;&#x9009;&#x62E9;&#x7684;&#x7279;&#x5F81;&#x4E0E;&#x9884;&#x6D4B;&#x65E0;&#x5173;&#xFF0C;&#x90A3;&#x4E48;&#x56E0;&#x4E3A;&#x89E3;&#x91CA;&#x5668;&#x6CA1;&#x6709;&#x8868;&#x73B0;&#x51FA;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x6BD4;&#x5176;&#x4ED6;&#x540C;&#x6837;&#x65E0;&#x5173;&#x7684;&#x7279;&#x5F81;&#x66F4;&#x91CD;&#x8981;&#x800C;&#x60E9;&#x7F5A;&#x89E3;&#x91CA;&#x5668;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;</p>
<p><img src="../image/3.3.png" alt=""></p>
<p>&#x56FE;3.3:&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x9009;&#x62E9;&#x8DB3;&#x591F;&#x7684;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x3002;&#x5BF9;&#x4E8E;&#x5305;&#x542B;&#x201C;very good&#x201D;&#x6216;&#x201C;not good&#x201D;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x201C;good&#x201D;&#x662F;&#x9884;&#x6D4B;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7279;&#x5F81;&#xFF0C;&#x4F46;&#x6A21;&#x578B;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x5B83;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x4E0D;&#x5305;&#x542B;&#x201C;very good&#x201D;&#x6216;&#x201C;not good&#x201D;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x6A21;&#x578B;&#x4E0D;&#x4F1A;&#x5448;&#x73B0;&#x8FD9;&#x79CD;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p><strong>&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5145;&#x5206;&#x6027;</strong>  &#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x9009;&#x62E9;&#x7684;&#x7279;&#x5F81;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5145;&#x5206;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x5373;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x4F9D;&#x8D56;&#x5B83;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x7684;&#x7279;&#x5F81;&#x3002;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;$m$&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x5176;&#x9009;&#x62E9;&#x5668;&#x548C;&#x9884;&#x6D4B;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5185;&#x90E8;&#x7D27;&#x6025;&#x901A;&#x4FE1;&#x534F;&#x8BAE;(Foerster et al.&#xFF0C; 2016)&#xFF0C;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x5668;&#x548C;&#x9884;&#x6D4B;&#x5668;&#x5728;&#x8BAD;&#x7EC3;&#x4E2D;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x9690;&#x85CF;&#x7F16;&#x7801;&#xFF0C;&#x4F7F;&#x672A;&#x88AB;&#x9009;&#x62E9;&#x7684;&#x7279;&#x5F81;&#x5BF9;&#x9884;&#x6D4B;&#x4EA7;&#x751F;&#x91CD;&#x8981;&#x5F71;&#x54CD;&#x3002;&#x56FE;3.3&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x8DB3;&#x591F;&#x5B50;&#x96C6;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5BF9;&#x4E8E;&#x5305;&#x542B;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x201C;very good&#x201D;&#x6216;&#x201C;not good&#x201D;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x4F8B;&#x5982;$x^{(1)}$:&#x201C;the movie is very good&#x201D;&#x3002;&#x548C;$x^{(2)}$:&#x201C;The movie is not good&#x3002;&#x201D;&#xFF0C;&#x201C;good&#x201D;&#x7279;&#x5F81;&#x5BF9;&#x9884;&#x6D4B;&#x6709;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x6A21;&#x578B;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x5B83;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x5305;&#x542B;&#x201C;very good&#x201D;&#x6216;&#x201C;not good&#x201D;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x4EFB;&#x4F55;&#x5B9E;&#x4F8B;&#xFF0C;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x578B;&#x4E0D;&#x4F1A;&#x663E;&#x793A;&#x4E0D;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5047;&#x76F8;&#x5173;&#x6027;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x66F4;&#x8BEF;&#x5BFC;&#x7684;&#x7279;&#x5F81;&#x9009;&#x62E9;&#x505A;&#x9009;&#x62E9;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4E0E;&#x68C0;&#x67E5;&#x6700;&#x5C0F;&#x6761;&#x4EF6;&#x4E0D;&#x540C;&#xFF0C;&#x68C0;&#x67E5;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;$m$&#x662F;&#x5426;&#x5728;&#x5B9E;&#x4F8B;$x$&#x4E0A;&#x9009;&#x62E9;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x5B50;&#x96C6;&#x8981;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x5C11;&#x5F97;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x6709;</p>
<p><script type="math/tex; ">
</script></p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x9009;&#x62E9;-&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x65E0;&#x8BBA;&#x662F;&#x4F5C;&#x4E3A;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x8FD8;&#x662F;&#x4F5C;&#x4E3A;&#x9A8C;&#x8BC1;&#x89E3;&#x91CA;&#x8005;&#x7684;&#x5B9E;&#x9A8C;&#x53F0;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x4E8B;&#x5148;&#x68C0;&#x67E5;&#x5176;&#x5145;&#x5206;&#x6027;&#x6761;&#x4EF6;&#x3002;</p>
<p><strong>&#x5728;&#x9009;&#x62E9;&#x76F8;&#x4E92;&#x62B5;&#x6D88;&#x7279;&#x5F81;&#x65F6;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#x3002;</strong> &#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x9009;&#x62E9;&#x8DB3;&#x591F;&#x7684;&#x7279;&#x6027;&#x7684;&#x6700;&#x5C0F;&#x96C6;&#x5408;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x4F1A;&#x9009;&#x62E9;&#x67D0;&#x4E9B;&#x76F8;&#x4E92;&#x62B5;&#x6D88;&#x7684;&#x7279;&#x5F81;&#x7EC4;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x9009;&#x62E9;&#x5176;&#x4ED6;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#x6709;&#x4F18;&#x70B9;&#x4E5F;&#x6709;&#x7F3A;&#x70B9;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x6709;&#x673A;&#x4F1A;&#x9009;&#x62E9;&#x5F62;&#x6210;&#x771F;&#x6B63;&#x53D6;&#x6D88;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9009;&#x62E9;&#x5F62;&#x6210;&#x4EBA;&#x5DE5;&#x9020;&#x6210;&#x7684;&#x53D6;&#x6D88;&#x7684;&#x7279;&#x5F81;&#x3002;&#x6700;&#x5C0F;&#x5145;&#x5206;&#x5B50;&#x96C6;&#x89E3;&#x91CA;&#x5668;&#x548C;Shapley&#x89E3;&#x91CA;&#x5668;&#x90FD;&#x4E0D;&#x80FD;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x76F8;&#x53CD;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x9009;&#x62E9;&#x5F62;&#x6210;&#x4EBA;&#x5DE5;&#x9020;&#x6210;&#x7684;&#x53D6;&#x6D88;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9009;&#x62E9;&#x5F62;&#x6210;&#x771F;&#x6B63;&#x7684;&#x53D6;&#x6D88;&#x7684;&#x7279;&#x5F81;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7528;&#x6237;&#x9700;&#x8981;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x79CD;&#x98CE;&#x9669;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4EE5;&#x5C11;&#x4E8E;&#x6307;&#x6570;&#x6570;&#x91CF;&#x7684;&#x67E5;&#x8BE2;&#x5230;&#x6A21;&#x578B;&#x662F;&#x5426;&#x6709;&#x975E;&#x9009;&#x62E9;&#x7279;&#x5F81;&#x62B5;&#x6D88;&#x5F7C;&#x6B64;&#x3002;</p>
<h2 id="33-&#x7ED3;&#x8BBA;&#x548C;&#x5F00;&#x653E;&#x5F0F;&#x95EE;&#x9898;"><a name="33-&#x7ED3;&#x8BBA;&#x548C;&#x5F00;&#x653E;&#x5F0F;&#x95EE;&#x9898;" class="anchor-navigation-ex-anchor" href="#33-&#x7ED3;&#x8BBA;&#x548C;&#x5F00;&#x653E;&#x5F0F;&#x95EE;&#x9898;"><i class="fa fa-link" aria-hidden="true"></i></a><a name="33-&#x7ED3;&#x8BBA;&#x548C;&#x5F00;&#x653E;&#x5F0F;&#x95EE;&#x9898;" class="plugin-anchor" href="#33-&#x7ED3;&#x8BBA;&#x548C;&#x5F00;&#x653E;&#x5F0F;&#x95EE;&#x9898;"><i class="fa fa-link" aria-hidden="true"></i></a>3.3 &#x7ED3;&#x8BBA;&#x548C;&#x5F00;&#x653E;&#x5F0F;&#x95EE;&#x9898;</h2>
<p>&#x200B;        &#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x63ED;&#x793A;&#x4E86;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x6765;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x4E9B;&#x56F0;&#x96BE;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x8BF4;&#x660E;&#x4E86;&#x5728;&#x5B9E;&#x4F8B;&#x4E0A;&#x5BF9;&#x6A21;&#x578B;&#x7684;&#x9884;&#x6D4B;&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x6211;&#x8FD8;&#x5C55;&#x793A;&#x4E86;&#x4E24;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x4E8B;&#x540E;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x5B9E;&#x89E3;&#x91CA;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x53D1;&#x73B0;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x4F18;&#x52BF;&#x548C;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<p>&#x200B;        &#x5176;&#x6B21;&#xFF0C;&#x6211;&#x7814;&#x7A76;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x7684;&#x81EA;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#xFF0C;&#x79F0;&#x4E3A;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#xFF0C;&#x5E76;&#x5C55;&#x793A;&#x4E86;&#x5B83;&#x5728;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x7684;&#x89E3;&#x91CA;&#x65B9;&#x9762;&#x7684;&#x4F18;&#x52BF;&#x548C;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<p>&#x200B;        &#x672C;&#x7AE0;&#x7684;&#x7814;&#x7A76;&#x7ED3;&#x679C;&#x9F13;&#x52B1;&#x7814;&#x7A76;&#x8005;&#x76F4;&#x63A5;&#x9648;&#x8FF0;&#x4ED6;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x548C;&#x9A8C;&#x8BC1;&#x6846;&#x67B6;&#x7684;&#x89C4;&#x683C;&#x3002;&#x4ED6;&#x4EEC;&#x4E5F;&#x94FA;&#x5E73;&#x4E86;&#x9053;&#x8DEF;,&#x8FDB;&#x4E00;&#x6B65;&#x7814;&#x7A76;,&#x5982;:(1)&#x54EA;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x771F;&#x5B9E;&#x7279;&#x5F81;&#x5B83;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x6216;&#x7EC4;&#x5408;&#x6700;&#x9002;&#x5408;&#x7528;&#x6237;&#x5728;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x4F7F;&#x7528;,&#x548C;(2)&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5BF9;&#x9009;&#x62E9;&#x5668;-&#x9884;&#x6D4B;&#x5668;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x4EE5;&#x589E;&#x5F3A;&#x6240;&#x9009;&#x7279;&#x5F81;&#x7684;&#x5145;&#x5206;&#x6027;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../第二章/第二章.html" class="navigation navigation-prev " aria-label="Previous page: 第二章  深度神经网络解释的背景知识">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../第四章/第四章.html" class="navigation navigation-next " aria-label="Next page: 第四章 验证基于特征的事后解释方法">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三章 基于特征解释的难点和主观性","level":"4.1","depth":1,"next":{"title":"第四章 验证基于特征的事后解释方法","level":"5.1","depth":1,"path":"第四章/第四章.md","ref":"第四章/第四章.md","articles":[]},"previous":{"title":"第二章  深度神经网络解释的背景知识","level":"3.1","depth":1,"path":"第二章/第二章.md","ref":"第二章/第二章.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","splitter","expandable-chapters-small","anchors","github","github-buttons","donate","sharing-plus","anchor-navigation-ex","favicon","mathjax-pro","livereload"],"styles":{"website":"./styles/website.css"},"pluginsConfig":{"pluginsConfig":{"summary":{"excludeDir":["image"],"readme":"README.md","summary":"SUMMARY.md","introduction":{"title":"introduction","file":"README.md"}}},"github":{"url":"https://github.com/Blankj"},"livereload":{},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"donate":{"alipay":"./source/images/donate.png","alipayText":" ","button":"赞赏","title":"","wechat":"","wechatText":"微信打赏"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"favicon":{"shortcut":"./source/images/favicon.jpg","bookmark":"./source/images/favicon.jpg","appleTouch":"./source/images/apple-touch-icon.jpg","appleTouchMore":{"120x120":"./source/images/apple-touch-icon.jpg","180x180":"./source/images/apple-touch-icon.jpg"}},"github-buttons":{"buttons":[{"user":"Blankj","repo":"glory","type":"star","size":"small","count":true}]},"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"expandable-chapters-small":{},"sharing":{"qq":false,"all":["google","facebook","weibo","twitter","qq","qzone","linkedin","pocket"],"douban":false,"facebook":false,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{}},"theme":"default","author":"Blankj","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Blankj's Glory","language":"zh-hans","links":{"sidebar":{"我的狗窝":"https://blankj.com"}},"gitbook":"3.2.3","description":"select * from learn"},"file":{"path":"第三章/chapter3.md","mtime":"2020-10-22T01:42:47.955Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-23T12:59:43.801Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

